Repository: 3v3r51nc3/ChatGPT-Telegram-Bot
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: uk

source: At your service.
uk: До ваших послуг.

source: Your chat history with assistant was erased.
uk: Історію вашого чату з асистентом було стерто.

source: You have no chat history with assistant to erase.
uk: Ви не маєте історії чату з помічником, яку можна стерти.

source: Hello *{0}*!
uk: Добрий день, *{0}*!

source: help_message
uk: Для приватного використання: - Використовуйте /clear, щоб стерти всю історію чату з асистентом. 🗑 - Використовуйте /draw PROMPT для створення зображень. 🎨 - Надсилайте посилання на YouTube і Tiktok, щоб завантажити відео. 📹🎵 Групове використання: Щоб забезпечити правильну роботу бота у групі, надайте боту роль адміністратора, щоб він міг бачити всі повідомлення в групі. Це дозволить використовувати команду /call: Відповідайте на повідомлення використовуючи команду /call, щоб обробляти повідомлення на яке ви відповіли, як запит для асистента. Також ви можете просто надіслати команду /call і бот відгукнеться на ваш поклик. Далі ви можете просто відповідати на повідомлення бота. Він обробить вашу відповідь так, ніби ви надіслали повідомлення в приватному чаті. До того ж можна використовувати шаблон /call ЗАПИТ для безпосереднього надіслання запиту. ✨

source: GPT Provider
uk: Постачальник GPT

source: Language
uk: Мова

source: ❌Delete
uk: ❌Видалити

source: ↩️Back
uk: ↩️Назад

source: This is not your request
uk: Це не ваш запит

source: Settings⚙️
uk: Налаштування⚙️

source: Choose your GPT provider. By default AiChatOnline is enabled.
uk: Виберіть бажаного постачальника GPT. За замовчуванням - AiChatOnline.

source: You chose the same provider.
uk: Ви вибрали того самого постачальника.

source: Provider was changed
uk: Постачальник був змінений.

source: Choose your language:
uk: Виберіть вашу мову:

source: You chose the same language
uk: Ви вибрали ту саму мову.

source: Language have been changed.
uk: Мова була змінена.

source: Settings were deleted.
uk: Налаштування були видалені.

source: Generating...
uk: Генерація відповіді...

source: Sorry, no provider has responded.
uk: Вибачте, ні один з провайдерів не відповів.

source: Too many requests. Changing provider to {0} and retrying.
uk: Забагато запитів. Змінюю постачальника на {0} і повторю спробу.

source: Sorry, your message wasn't handled properly. Please retry or try to clear your history.
uk: Вибачте, ваше повідомлення не було оброблено належним чином. Будь ласка, повторіть спробу, або очистіть історію повідомлень.

source: Sorry, some problem occurred. Changing provider to {0} and retrying
uk: Вибачте, виникла проблема. Змінюю постачальника на {0} та повторюю спробу.

source: Couldn't recognize anything.
uk: Не вдалося розпізнати.

source: Sorry, some problem occurred during transcription.
uk: Вибачте, виникла помилка під час транскрипції.

source: Sorry, some problem occurred
uk: Вибачте, виникла проблема

source: Please, provide a prompt. Add it after the command or just reply with this command to the prompt.
uk: Будь ласка, задайте запит. Додайте його після команди або відповісте на нього цією командою.

source: Recognize text
uk: Розпізнати текст

source: What do you want to do with the image?
uk: Що бажаєте зробити з зображенням?

source: Sorry, some problem occurred during recognition.
uk: Вибачте, виникла помилка під час обробки зображення.

source: Downloading the video...
uk: Завантажуємо відео...

source: Couldn't download the video
uk: Не вдалося завантажити відео

source: Choose type/resolution
uk: Виберіть тип/якість

source: Sorry, filesize of this video is greater than the limit (50 Mb)
uk: Вибачте, розмір відео перевищує 50 мб
